Select only the rows where the student’s favorite color is green or red and their grade is above 90

In [3]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('expand_frame_repr', False)

students_df = pd.DataFrame(
    data={
        'name': ['Tim Voss', 'Nicole Johnson', 'Elsa Williams', 'John James', 'Catherine Jones'],
        'age': [19, 20, 21, 20, 23],
        'favorite_color': ['red', 'yellow', 'green', 'blue', 'green'],
        'grade': [91, 95, 82, 75, 93]
    }
)


def grades_colors(students_df: pd.DataFrame):
    df = students_df.loc[
        (students_df['favorite_color'].isin(['green', 'red']))
        & (students_df['grade'] > 90)
    ]
    return df


grades_colors(students_df)

  name  age favorite_color  grade
0    a   19            red     91
4    e   23          green     93

## Over 100 dollars

You’re given two dataframes: transactions and products.

The transactions dataframe contains transaction ids, product ids, and the total amount of each product sold.

The products dataframe contains product ids and prices.

Write a function to return a dataframe containing every transaction with a total value of over \$100$100. Include the total value of the transaction as a new column in the dataframe.

In [4]:
import pandas as pd


def transactions_over_100(df_transactions: pd.DataFrame, df_products: pd.DataFrame):
    df_tmp = df_transactions.merge(
        df_products, 
        how='left', 
        on='product_id'
    )
    df_tmp['total_value'] = df_tmp['price'] * df_tmp['amount']
    df_tmp = df_tmp.loc[df_tmp['total_value'] > 100]
    df_tmp = df_tmp[['transaction_id', 'product_id', 'amount', 'total_value']]
    return df_tmp


transactions = {"transaction_id" : [1, 2, 3, 4, 5], "product_id" : [101, 102, 103, 104, 105], "amount" : [3, 5, 8, 3, 2]}
products = {"product_id" : [101, 102, 103, 104, 105], "price" : [20.00, 21.00, 15.00, 16.00, 52.00]}

df_transactions = pd.DataFrame(transactions)
df_products = pd.DataFrame(products)
df_ans = transactions_over_100(df_transactions, df_products)

df_ans

   transaction_id  product_id  amount  total_value
1               2         102       5        105.0
2               3         103       8        120.0
4               5         105       2        104.0

## Rain on rainy days

You’re given a dataframe df_rain containing rainfall data. The dataframe has two columns: day of the week and rainfall in inches.

Write a function median_rainfall to find the median amount of rainfall for the days on which it rained.

Note: You may assume it rained on at least one of the days.

In [5]:
import pandas as pd


def median_rainfall(df_rain):
    df_tmp = df_rain.loc[df_rain['Inches'] > 0]
    return df_tmp['Inches'].median()


rainfall = {"Day" : ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"], "Inches" : [0, 1.2, 0, 0.8, 1]}
df_rain = pd.DataFrame(rainfall)
median_rainfall(df_rain)

1.0

## Impute median

You’re given a dataframe df_cheeses containing a list of the price of various cheeses from California. The dataframe has missing values in the price column.

Write a function cheese_median to impute the median price of the selected California cheeses in place of the missing values. You may assume at least one cheese is not missing its price.

In [2]:
import pandas as pd


def cheese_median(df):
    
    # m = df['Price'].median()
    # df.loc[df['Price'].isna(), 'Price'] = m
    
    df['Price'] = df['Price'].fillna(df['Price'].median())
    
    return df



cheeses = {
    "Name": [
        "Bohemian Goat", 
        "Central Coast Bleu", 
        "Cowgirl Mozzarella", 
        "Cypress Grove Cheddar", 
        "Oakdale Colby"
    ], 
    "Price" : [15.00, None, 30.00, None, 45.00]
}
df_cheese = pd.DataFrame(cheeses)
cheese_median(df_cheese)

                    Name  Price
0          Bohemian Goat   15.0
1     Central Coast Bleu   30.0
2     Cowgirl Mozzarella   30.0
3  Cypress Grove Cheddar   30.0
4          Oakdale Colby   45.0

## t value via pandas

You are given a dataframe with a single column, 'var'.

Calculated the t-value for the mean of ‘var’ against a null hypothesis that μ = μ_0μ=μ 
0
​
 .

Note: You do not have to calculate the p-value of the test or run the test.

In [5]:
import pandas as pd


def t_score(mu0, df: pd.DataFrame):
    
    mean = df['var'].mean()
    n = len(df)
    s = df['var'].var()
    
    t = (mean - mu0) / (s / n) ** (1 / 2)
    
    return t


mu0 = 1
df = pd.DataFrame({
    'var': [-34, 40, -89, 5, -26]
})
round(t_score(mu0, df), 6)

-1.015614

## First Names Only

You’re given a dataframe containing a list of user IDs and their full names (e.g. ‘James Emerson’).

Transform this dataframe into a dataframe that contains the user ids and only the first name of each user.

In [1]:
import pandas as pd


def first_name_only(users_df):
    df_name = users_df['name'].str.split(' ', expand=True)
    users_df['name'] = df_name[0]
    return users_df


users_df = pd.DataFrame({
    'user_id': [1034, 9430, 7281, 5264, 8995],
    'name': ['James Emerson', 'Fiona Woodward', 'Alvin Gross', 'Deborah Handler', 'Leah Xue']
})
first_name_only(users_df)

   user_id     name
0     1034    James
1     9430    Fiona
2     7281    Alvin
3     5264  Deborah
4     8995     Leah

## Previous NaN values

Given a dataframe with three columns:

- client_id
- ranking
- value

Write a function to fill the NaN values in the value column with the previous non-NaN value from the same client_id ranked in ascending order.

If there doesn’t exist a previous client_id then return the previous value.

### Solution

Pandas **fillna(method='ffill')** fill the NA with the previous value.

In [12]:
import pandas as pd


def previous_nan_values(clients_df):
    clients_df = clients_df.sort_values(by=['client_id', 'ranking'])
    clients_df['value'] = clients_df['value'].fillna(method='ffill')
    clients_df = clients_df.sort_values(by=['ranking', 'client_id'])
    return clients_df


clients_df = pd.DataFrame({
    'client_id': [1001, 1001, 1001, 1002, 1002, 1002, 1003, 1003],
    'ranking': [1, 2, 3, 1, 2, 3, 1, 2],
    'value': [1000, None, 1200, 1500, 1250, None, 1100, None]
})
previous_nan_values(clients_df)

   client_id  ranking   value
0       1001        1  1000.0
3       1002        1  1500.0
6       1003        1  1100.0
1       1001        2  1000.0
4       1002        2  1250.0
7       1003        2  1100.0
2       1001        3  1200.0
5       1002        3  1250.0

## Complete addresses

You’re given two dataframes. One contains information about addresses and the other contains relationships between various cities and states.

Write a function complete_address to create a single dataframe with complete addresses in the format of street, city, state, zip code.

In [19]:
addresses = {
    "address": [
        "4860 Sunset Boulevard, San Francisco, 94105", 
        "3055 Paradise Lane, Salt Lake City, 84103", 
        "682 Main Street, Detroit, 48204", 
        "9001 Cascade Road, Kansas City, 64102", 
        "5853 Leon Street, Tampa, 33605"
    ]
}

cities = {
    "city": [
        "Salt Lake City", 
        "Kansas City", 
        "Detroit", 
        "Tampa", 
        "San Francisco"
    ], 
    "state": [
        "Utah", 
        "Missouri", 
        "Michigan", 
        "Florida", 
        "California"
    ]
}

df_addresses = pd.DataFrame(addresses)
df_cities = pd.DataFrame(cities)


df_ad = df_addresses["address"].str.split(", ", expand=True)
df_ad.rename(
    columns={
        0: "street",
        1: "city",
        2: "zip"
    },
    inplace=True
)

df_m = df_ad.merge(df_cities, on="city")
df_m["address"] = df_m["street"] + ", " + df_m["city"] + ", " + df_m["state"] + ", " + df_m["zip"]
df_m = df_m[["address"]]

In [13]:
import pandas as pd


addresses = {
    "address": [
        "4860 Sunset Boulevard, San Francisco, 94105", 
        "3055 Paradise Lane, Salt Lake City, 84103", 
        "682 Main Street, Detroit, 48204", 
        "9001 Cascade Road, Kansas City, 64102", 
        "5853 Leon Street, Tampa, 33605"
    ]
}

cities = {
    "city": [
        "Salt Lake City", 
        "Kansas City", 
        "Detroit", 
        "Tampa", 
        "San Francisco"
    ], 
    "state": [
        "Utah", 
        "Missouri", 
        "Michigan", 
        "Florida", 
        "California"
    ]
}

df_addresses = pd.DataFrame(addresses)
df_cities = pd.DataFrame(cities)


def complete_address(df_addresses: pd.DataFrame, df_cities: pd.DataFrame):
    
    df_tmp = df_addresses['address'].str.split(', ', expand=True)
    df_tmp = df_tmp.rename(columns={
        0: 'street',
        1: 'city',
        2: 'zip'
    })
    df_tmp = df_tmp.merge(df_cities, how='left', on='city')
    
    # df_tmp['address'] = df_tmp['street'] + ', ' + df_tmp['city'] + ', ' + df_tmp['state'] + ', ' + df_tmp['zip']
    df_tmp['address'] = df_tmp[['street', 'city', 'state', 'zip']].agg(', '.join, axis=1)
    
    df_tmp = df_tmp[['address']]
    return df_tmp
    
complete_address(df_addresses, df_cities)

                                             address
0  4860 Sunset Boulevard, San Francisco, Californ...
1    3055 Paradise Lane, Salt Lake City, Utah, 84103
2          682 Main Street, Detroit, Michigan, 48204
3    9001 Cascade Road, Kansas City, Missouri, 64102
4            5853 Leon Street, Tampa, Florida, 33605

## Book avialability update

As a Python-proficient librarian, you’re building a system to check the availability of book copies more efficiently. Write a function update_availability to update the copies_available value for a specific book_id in your dataframe and return the updated dataframe. Note: If you can’t find the book_id, return the original dataframe without any changes.

In [6]:
import pandas as pd


def update_availability(book_id: int, copies: int, df_books: pd.DataFrame):
    df_tmp = df_books.copy()
    df_tmp.loc[df_tmp["book_id"] == book_id, "copies_available"] = copies 
    return df_tmp


book_id = 3
copies = 8
df_books = pd.DataFrame({
    "book_id": [0, 1, 2, 3, 4],
    "book_title": ["a", "b", "c", "d", "e"],
    "copies_available": [5, 7, 3, 2, 10]
})

# update_availability(book_id, copies, df_books)

# If you can't find the book_id
update_availability(5, copies, df_books)

   book_id book_title  copies_available
0        0          a                 5
1        1          b                 7
2        2          c                 3
3        3          d                 2
4        4          e                10